testapp/app/controllers/sessions_controller.rb

  def create
  	admin = Admin.find_by(username: params[:session][:username].downcase)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."username" = ? LIMIT ?  [["username", "ashish"], ["LIMIT", 1]]