testapp/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "age", "email", "adharno", "panno", "mobileno", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save